# Assignment SQL
## Assignment -4 :

In [1]:
import mysql.connector as conn
mydb = conn.connect(host = "localhost" , username = "root", passwd = "Anindita@123")
cursor = mydb.cursor()

In [2]:
cursor.execute("use worker_db")

<b>Q-1. Write an SQL query to print the FIRST_NAME from Worker table after replacing ‘a’ with ‘A’.</b>

In [8]:
cursor.execute("SELECT FIRST_NAME,REPLACE(FIRST_NAME, 'a', 'A') from workers")
cursor.fetchall()

[('Donald', 'DonAld'),
 ('Douglas', 'DouglAs'),
 ('Jennifer', 'Jennifer'),
 ('Michael', 'MichAel'),
 ('Pat', 'PAt'),
 ('Susan', 'SusAn'),
 ('Hermann', 'HermAnn'),
 ('Shelley', 'Shelley'),
 ('William', 'WilliAm'),
 ('Steven', 'Steven'),
 ('Neena', 'NeenA'),
 ('Lex', 'Lex'),
 ('Alexander', 'AlexAnder'),
 ('Bruce', 'Bruce'),
 ('David', 'DAvid'),
 ('Valli', 'VAlli'),
 ('Diana', 'DiAnA'),
 ('Nancy', 'NAncy'),
 ('Daniel', 'DAniel'),
 ('John', 'John'),
 ('Ismael', 'IsmAel'),
 ('Jose Manuel', 'Jose MAnuel'),
 ('Luis', 'Luis'),
 ('Den', 'Den'),
 ('Alexander', 'AlexAnder'),
 ('Shelli', 'Shelli'),
 ('Sigal', 'SigAl'),
 ('Guy', 'Guy'),
 ('Karen', 'KAren'),
 ('Matthew', 'MAtthew'),
 ('Adam', 'AdAm'),
 ('Payam', 'PAyAm'),
 ('Shanta', 'ShAntA'),
 ('Kevin', 'Kevin'),
 ('Julia', 'JuliA'),
 ('Irene', 'Irene'),
 ('James', 'JAmes'),
 ('Steven', 'Steven'),
 ('Laura', 'LAurA'),
 ('Mozhe', 'Mozhe'),
 ('James', 'JAmes'),
 ('TJ', 'TJ'),
 ('Jason', 'JAson'),
 ('Michael', 'MichAel'),
 ('Ki', 'Ki'),
 ('Hazel', 'HAzel'),
 ('Renske', 'Renske'),
 ('Stephen', 'Stephen'),
 ('John', 'John'),
 ('Joshua', 'JoshuA')]

<b>Q-2. Write an SQL query to print all Worker details from the Worker table order by FIRST_NAME Ascending and DEPARTMENT Descending.</b>

In [14]:
cursor.execute("(select FIRST_NAME,DEPARTMENT_ID from workers order by DEPARTMENT_ID desc) order by FIRST_NAME limit 10")
cursor.fetchall()

[('Adam', '50'),
 ('Alexander', '30'),
 ('Alexander', '60'),
 ('Bruce', '60'),
 ('Daniel', '100'),
 ('David', '60'),
 ('Den', '30'),
 ('Diana', '60'),
 ('Donald', '50'),
 ('Douglas', '50')]

<b>Q-3. Write an SQL query to fetch the names of workers who earn the highest salary.</b>

In [15]:
cursor.execute("select FIRST_NAME,SALARY from workers where SALARY = (Select max(SALARY) from workers)")
cursor.fetchall()

[('Alexander', '9000'), ('Daniel', '9000')]